/*
//Задача 1
//Напишите программу, которая на вход принимает число и выдаёт его квадрат
Console.Write("Input your number: ");
int num=Convert.ToInt32(Console.ReadLine());
int result=num*num;
Console.WriteLine("Your number is " + num + ". Square of this number is " + result);


//Задача 3
//Напишите программу, которая на вход принимает 2 числа и проверяет, является ли первое число квадратом второго
Console.Clear();
Console.Write("Input 1st number: ");
int num1=Convert.ToInt32(Console.ReadLine());
Console.Write("Input 2nd number: ");
int num2=Convert.ToInt32(Console.ReadLine());
//int result=num2*num2;
if(num1==num2*num2)
{
    Console.Write("Your first number is a square of the second number");
}
else
{
    Console.Write("Your first number is NOT a square number of the second number");
}
*/

//Задача 5
//Напишите программу, которая на вход принимает одно число N, а на выходе показывает все целые числа от -N до N

Console.Clear();
